#include "stdafx.h"

DWORD gdwCmdLineCount = 0;
CHAR gszAccountName[_MAX_PATH] = { 0 };
CHAR gszUserName[_MAX_PATH] = { 0 };
CHAR gszListNameInFile[_MAX_PATH + 1] = { 0 };
////CHAR gszListNameInFile[_MAX_PATH] = { 0 };
CHAR gszPassword[288] = { 0 };
CHAR gszFullPathName[288] = { 0 };
CHAR gszComputerName[_MAX_PATH] = { 0 };
bool gbUseUserName = false;
bool gbUsePassword = false;
bool gbConnected = false;
SC_HANDLE ghSCHandle = NULL;

typedef struct tagThreadParam
{
	bool bFlags1;
	CHAR* pszMachineName;
	CHAR* pszAddress;
	bool bFlags2;
	CHAR* pszAppName;
	CHAR* pszServerName;
	CHAR* pszImageName;
	CHAR* pszSvcName;
	CHAR* pszUserName;
	CHAR* pszPassword;
	DWORD dwValue;
}THREADPARAM,*PTHREADPARAM,*LPTHREADPARAM;

enum ELicenseAgreementDialogIDs
{
	IDC_STATIC_INFO = 502,
	IDC_EDIT = 500,
	IDC_BUTTON_PRINT = 501,
	IDC_BUTTON_AGREE = 1,
	IDC_BUTTON_DECLINE = 2,
};

BOOL StartServer(LPCSTR lpMachineName, LPCSTR lpDisplayName, LPCSTR lpServiceName, LPCSTR lpBinaryPathName, bool fInteractive);



BOOL IsIOTUAP()
{
	HKEY hKey = NULL;
	BOOL ret = FALSE;
	DWORD cbData = 520;
	DWORD Type = 0;
	WCHAR szText[_MAX_PATH] = { 0 };

	if (!RegOpenKeyA(HKEY_LOCAL_MACHINE, "Software\\Microsoft\\windows nt\\currentversion", &hKey))
	{
		if (!RegQueryValueExW(hKey, L"ProductName", 0, &Type, (LPBYTE)szText, &cbData)
			&& !_wcsicmp(L"iotuap", szText))
			ret = TRUE;
		RegCloseKey(hKey);
	}
	return ret;
}

BOOL OutputHandleIsValid()
{
	return GetFileType(GetStdHandle(STD_OUTPUT_HANDLE)) == FILE_TYPE_PIPE;
}

void Log(LPCSTR lpszFormat, ...)
{
	va_list ArgList;
	va_start(ArgList, lpszFormat);
	if (OutputHandleIsValid())
	{
		vfprintf_s(stderr, lpszFormat, ArgList);
	}
	else
	{
		vfprintf_s(stdout, lpszFormat, ArgList);
	}
}
BOOL IsTypeInQuit()
{
	BOOL ret =FALSE;
	BOOL fDone = FALSE;
	CHAR chText;
	wprintf(L"SYSINTERNALS SOFTWARE LICENSE TERMS");
	do
	{
		printf_s("Accept Eula (Y/N)?");
		chText = _getch();
		printf_s("%c\n", chText);
		if (chText == 'y' || chText == 'Y')
		{
			ret = TRUE;
			fDone = TRUE;
		}
	} while (chText != 'n' && chText != 'N' && fDone != TRUE);
	return ret;
}

BOOL IsEulaAccepted(HKEY hKey, LPCSTR lpSubKey)
{
	HKEY hSubKey = 0;
	DWORD dwValue = 0;
	BOOL result = FALSE;
	REG_LINK;
	if (!RegOpenKeyExA(hKey, lpSubKey, NULL, KEY_WOW64_64KEY|KEY_QUERY_VALUE, &hSubKey))
	{
		DWORD cbData = 4;
		LONG ret = RegQueryValueExA(hSubKey, "EulaAccepted", 0, 0, (LPBYTE)&dwValue, &cbData);
		RegCloseKey(hSubKey);
		if (!ret)
		{
			if (dwValue)
				result = TRUE;
		}
	}
	return result;
}

BOOL IsNanoServer()
{
	HKEY hKey = NULL;
	BOOL ret = FALSE;
	DWORD cbData = sizeof(DWORD);
	DWORD Type = 0;
	DWORD dwValue = 0;

	if (!RegOpenKeyA(HKEY_LOCAL_MACHINE, "Software\\Microsoft\\Windows NT\\CurrentVersion\\Server\\ServerLevels", &hKey))
	{
		if (!RegQueryValueExA(hKey, "NanoServer", 0, &Type, (LPBYTE)&dwValue, &cbData) 
			&& Type == REG_DWORD 
			&& dwValue == 1)
			ret = TRUE;
		RegCloseKey(hKey);
	}
	return ret;
}


void PrintLicense()
{
	wprintf_s(L"%ls", L"SYSINTERNALS SOFTWARE LICENSE TERMS");
	wprintf_s(L"This is the first run of this program. You must accept EULA to continue.\n");
	wprintf_s(L"Use -accepteula to accept EULA.\n\n");
	exit(1);
}

CHAR* GetInternalInfo(CHAR* pFileInfo, WORD w1, WORD w2, LPCSTR lpszName)
{
	CHAR szText[_MAX_PATH] = { 0 };
	CHAR* lpRet = NULL;
	UINT uRet = 0;

	sprintf_s(szText, "\\StringFileInfo\\%04X%04X\\%s", w1, w2, lpszName);
	VerQueryValueA((void*)pFileInfo, szText, (void**)&lpRet, &uRet);
	return lpRet;
}

BOOL CmdLineHasAcceptEula(int argc, char** argv)
{
	if (argc <= 1)
		return FALSE;
	int  idx = 1;
	while (_mbsicmp((const UCHAR*)argv[idx], (const UCHAR*)"/accepteula")
		&& _mbsicmp((const UCHAR*)argv[idx], (const UCHAR*)"-accepteula"))
	{
		if (++idx >= argc)
			return FALSE;
	}
	return true;
}

BOOL CheckEulaAccepted(LPCSTR lpszText)
{
	BOOL result = FALSE;
	CHAR SubKey[_MAX_PATH] = { 0 };

	wsprintfA(SubKey, "%s\\%s", "Software\\Sysinternals", lpszText);
	if (IsEulaAccepted(HKEY_LOCAL_MACHINE, "Software\\Sysinternals")
		|| IsEulaAccepted(HKEY_CURRENT_USER, "Software\\Sysinternals"))
	{
		result = TRUE;
	}
	else
	{
		result = IsEulaAccepted(HKEY_CURRENT_USER, SubKey) != 0;
	}
	return result;
}

BOOL ConfigHasEulaAccepted(LPCSTR lpszName, int argc, char** argv)
{
	if (CheckEulaAccepted(lpszName)
		|| CmdLineHasAcceptEula(argc, argv))
		return TRUE;
	return FALSE;
}

BOOL CheckNoBanner(int argc, char** argv)
{
	BOOL ret = FALSE;
	if (argc > 1)
	{
		int index = 1;
		while (_mbsicmp((const UCHAR*)argv[index], (const UCHAR*) "/nobanner")
			&& _mbsicmp((const UCHAR*)argv[index], (const UCHAR*)"-nobanner"))
		{
			if (++index >= argc)
			{
				ret = FALSE;
				return ret;
			}
		}
		for (; index < argc - 1; ++index)
			argv[index] = argv[index + 1];
		--argc;
		ret = TRUE;
	}
	return ret;
}

BOOL ShowLicenseDialog(LPCSTR lpszName, int argc, char** argv);
BOOL ShowLicenseDialogEx(LPCSTR lpszName, BOOL bFlags);
BOOL AskToAcceptEula(LPCSTR lpszName, int argc, char** argv)
{
	//if (ConfigHasEulaAccepted(lpszName, argc, argv))
	//{
	//}

	if (!argc || !argv)
		return ShowLicenseDialog(lpszName, 0, NULL);
	BOOL fCheckEulaAccepted = CmdLineHasAcceptEula(argc, argv);
	if (fCheckEulaAccepted)
	{
		return ShowLicenseDialogEx(lpszName, TRUE);
	}
	return FALSE;
}


BOOL AcceptLicense(int argc, char** argv)
{
	CHAR szFileName[_MAX_PATH] = { 0 };
	DWORD dwHandle = 0;
	GetModuleFileNameA(NULL, szFileName, _MAX_PATH);

	DWORD dwSize = GetFileVersionInfoSizeA(szFileName, &dwHandle);
	CHAR* pFileInfo = new CHAR[dwSize];
	GetFileVersionInfoA(szFileName, 0, dwSize, (void*)pFileInfo);
	UINT uRet = 0;

	struct LANGANDCODEPAGE {
		WORD wLanguage;
		WORD wCodePage;
	} *lpTranslate = NULL;


	VerQueryValueA(pFileInfo, "\\VarFileInfo\\Translation", (void**)&lpTranslate, &uRet);
	CHAR* lpszName = GetInternalInfo(pFileInfo, lpTranslate->wLanguage, lpTranslate->wCodePage, "InternalName");
	BOOL fNoBanner = CheckNoBanner(argc, argv);
	if (fNoBanner&& !AskToAcceptEula(lpszName, argc, argv))
	{
		fprintf_s(stderr, "Eula declined.\n\n");
		free(pFileInfo);
		exit(1);
	}

	return FALSE;
}

size_t PE_CopyStringW(WCHAR* pszTarget, LPCWSTR lpszSource)
{
	size_t res = wcslen(lpszSource) + 1;
	LPCWSTR pszSrc = lpszSource;
	WCHAR chText = *pszSrc;
	WCHAR* pszDest = pszTarget;
	while (*pszSrc)
	{
		*pszDest++ = *pszSrc++;
	}
	*pszDest = 0;
	return res;
}

#define C_PAGES		4
#define sz_Or_Ord	WORD
#define titleLen	30
#define stringLen	30


//0x64=100
typedef struct
{
	WORD      dlgVer;			//0
	WORD      signature;		//0x02
	DWORD     helpID;			//0x04
	DWORD     exStyle;			//0x08
	DWORD     style;			//0x0C
	WORD      cDlgItems;		//0x0E
	short     x;				//0x10
	short     y;				//0x12
	short     cx;				//0x14
	short     cy;				//0x16
	sz_Or_Ord menu;				//0x18
	sz_Or_Ord windowClass;		//0x20
	WCHAR     title[titleLen];	//0x22
	WORD      pointsize;		//0x40	
	WORD      weight;			//0x42
	BYTE      italic;			//0x44
	BYTE      charset;			//0x45
	WCHAR     typeface[stringLen];//0x46
}DLGTEMPLATEEX;


typedef struct {
	DWORD     helpID;
	DWORD     exStyle;
	DWORD     style;
	short     x;
	short     y;
	short     cx;
	short     cy;
	DWORD     id;
	sz_Or_Ord windowClass;
	sz_Or_Ord title;
	WORD      extraCount;
} DLGITEMTEMPLATEEX;

////#pragma pack(1)
////struct PE_DLGTEMPLATE 
////{
////	DWORD style;
////	DWORD dwExtendedStyle;
////	short cdit;
////	short x, y, cx, cy;
////	DWORD dwValue;
////	WCHAR  WindowClass[0];
////
////};
////
////struct PE_DLGITEMTEMPLATE
////{
////	DWORD style;
////	DWORD dwExtendedStyle;
////	short x, y, cx, cy;
////	short id;
////	short wValue;
////	short wValue2;
////	WCHAR WindowTitle[0];
////};
////
////#pragma pack()
#define DLGITEM_STATIC 0x0082
#define DLGITEM_BUTTON 0x0080
struct MYDLGTEMPLATE : DLGTEMPLATE
{
	WCHAR wMenu;       // Must be 0
	WCHAR wClass;      // Must be 0
	WCHAR achTitle[2]; // Must be DWORD aligned
};

